# coding: utf-8

"""
Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4)
Определить, будут ли они вершинами параллелограмма
"""

def paral(p1,p2,p3,p4):
	# Cтороны попарно равны, ищем есть ли такие
	if ((p1[0] - p2[0]) == (p3[0] - p4[0]))&((p1[1] - p2[1]) == (p3[1] - p4[1])): 
		return True
	elif ((p1[0] - p3[0]) == (p2[0] - p4[0]))&((p1[1] - p3[1]) == (p2[1] - p4[1])):
		return True
	else: return False

a1 = [3,3]
a2 = [8,3]
a3 = [5,5]
a4 = [10,5]

if paral(a1, a2, a3, a4): 
	print("Да, это параллелограмм")
else : 
	print("Нет, это не параллелограмм")